[
    {
        "id": 1,
        "title": "المحطة الأولى: مدخل إلى تقنيات التعليم",
        "date": "الأسبوع 1",
        "summary": "استكشاف المفاهيم الأساسية لتقنيات التعليم والفرق بين الوسيلة والتقنية...",
        "fullContent": "في هذه المحطة الأولى، انطلقنا في رحلة استكشاف مفهوم تقنيات التعليم. تعلمت أن التقنية ليست مجرد أجهزة صلبة، بل هي عملية منظمة لتصميم وتطوير وتقويم التعلم. ركزنا على نموذج ADDIE وكيف يمثل حجر الزاوية في التصميم التعليمي.",
        "file": "reflections/reflection_01.docx"
    },
    {
        "id": 2,
        "title": "المحطة الثانية: نظريات التعلم الرقمي",
        "date": "الأسبوع 2",
        "summary": "تأملات في النظرية البنائية والاتصالية ودورهما في صياغة المحتوى الرقمي...",
        "fullContent": "المحطة الثانية كانت غنية بالجانب الفلسفي. قارنا بين المدرسة السلوكية والمعرفية وصولاً إلى البنائية. أدركت أن التعلم الرقمي الفعال هو الذي يتيح للطالب بناء معرفته بنفسه من خلال التفاعل مع الموارد المتاحة.",
        "file": "reflections/reflection_02.docx"
    },
    {
        "id": 3,
        "title": "المحطة الثالثة: استراتيجيات التفكير الناقد",
        "date": "الأسبوع 3",
        "summary": "كيف يمكن للتقنية أن تعزز مهارات التفكير العليا لدى المتعلمين...",
        "fullContent": "ناقشنا في هذه المحطة دور أدوات الويب 2.0 في تحفيز التفكير الناقد. التقنية ليست مجرد وعاء للمعلومات، بل هي مختبر للعقل يمكن من خلاله تحليل المشكلات وتركيب الحلول المبتكرة.",
        "file": "reflections/reflection_03.docx"
    },
    {
        "id": 4,
        "title": "المحطة الرابعة: التصميم التعليمي الفعال",
        "date": "الأسبوع 4",
        "summary": "تطبيق عملي على مبادئ التصميم المرئي وتنسيق المحتوى الإلكتروني...",
        "fullContent": "ركزنا هنا على الجماليات والوظيفة. تعلمت مبادرت التصميم (التباين، التكرار، المحاذاة، القرب) وكيف يؤثر ذلك على الحمل المعرفي للمتعلم. التصميم البسيط هو التصميم الأكثر فعالية.",
        "file": "reflections/reflection_04.docx"
    },
    {
        "id": 5,
        "title": "المحطة الخامسة: أدوات التأليف والإنتاج",
        "date": "الأسبوع 5",
        "summary": "تجربة إنتاج محتوى تفاعلي باستخدام أدوات التأليف الحديثة...",
        "fullContent": "خضنا تجربة عملية في إنتاج الدروس التفاعلية. استكشفنا كيف يمكن تحويل عرض تقديمي جامد إلى رحلة تفاعلية يشارك فيها الطالب ويتلقى تغذية راجعة فورية.",
        "file": "reflections/reflection_05.docx"
    },
    {
        "id": 6,
        "title": "المحطة السادسة: التقويم الإلكتروني الأصيل",
        "date": "الأسبوع 6",
        "summary": "ما وراء الاختبارات التقليدية: استخدام rubrics والتقييم بالمهام...",
        "fullContent": "التقويم هو محرك التعلم. تعلمنا كيف نصمم أدوات تقييم تقيس الأداء الفعلي للطالب وليس فقط قدرته على الحفظ. ناقشنا ملف الإنجاز كأداة للتقويم المستمر.",
        "file": "reflections/reflection_06.docx"
    },
    {
        "id": 7,
        "title": "المحطة السابعة: منصات التعلم وإدارتها",
        "date": "الأسبوع 7",
        "summary": "مقارنة بين أنظمة إدارة التعلم (LMS) وبيئات التعلم الشخصية (PLE)...",
        "fullContent": "استكشفنا عالم الـ LMS مثل Moodle و Canvas. أدركت أهمية توفير بيئة منظمة للطالب تتسم بسهولة الوصول ووضوح المسار التعليمي.",
        "file": "reflections/reflection_07.docx"
    },
    {
        "id": 8,
        "title": "المحطة الثامنة: المواطنة الرقمية والأخلاقيات",
        "date": "الأسبوع 8",
        "summary": "حماية الهوية الرقمية واحترام حقوق الملكية الفكرية في المحتوى التعليمي...",
        "fullContent": "تأملنا في الأبعاد الأخلاقية للتقنية. كمربين، علينا غرس قيم المواطنة الرقمية قبل تدريس الأدوات. حماية البيانات والخصوصية هي أولوية قصوى.",
        "file": "reflections/reflection_08.docx"
    },
    {
        "id": 9,
        "title": "المحطة التاسعة: الذكاء الاصطناعي في التعليم",
        "date": "الأسبوع 9",
        "summary": "استشراف مستقبل التعليم في ظل ثورة الذكاء الاصطناعي التوليدي...",
        "fullContent": "المحطة التاسعة كانت مثيرة للجانب المستقبلي. ناقشنا كيف يمكن للذكاء الاصطناعي تخصيص التعلم لكل طالب، والتحديات التي تواجه الميدان التربوي في ظل هذه التقنية.",
        "file": "reflections/reflection_09.docx"
    },
    {
        "id": 10,
        "title": "المحطة العاشرة: التعلم النقال والمنتشر",
        "date": "الأسبوع 10",
        "summary": "التعلم في أي وقت وفي أي مكان: استراتيجيات التعلم المصغر...",
        "fullContent": "تعمقنا في مفهوم التعلم النقال (M-Learning). القوة تكمن في تقديم وجبات تعليمية صغيرة (Micro-learning) تتناسب مع سرعة العصر واحتياجات المتعلم المتنقل.",
        "file": "reflections/reflection_10.docx"
    },
    {
        "id": 11,
        "title": "المحطة الحادية عشرة: الرؤية الختامية والنمو المهني",
        "date": "الأسبوع 11",
        "summary": "تلخيص مسار التعلم ووضع خطة للتطوير المستمر بعد البرنامج...",
        "fullContent": "في هذه المحطة الختامية، قمت بتجميع خيوط الرحلة. ملف الإنجاز هذا ليس نهاية المطاف، بل هو نقطة انطلاق نحو تطوير مستمر لممارساتي المهنية في ظل التقنيات المتسارعة.",
        "file": "reflections/reflection_11.docx"
    }
]